<!DOCTYPE html>
<html lang="en-US">
<head>
    <meta charset="utf-8">
</head>
<body>
<table>
    <tr>
        <td>
            <h3>ПРАВИЛА УХОДА ЗА СПОРТИВНОЙ ФОРМОЙ И ЭКИПИРОВКОЙ С НАНЕСЕНИЕМ</h3>
        </td>
    </tr>
    <tr>
        <td>
            <p>
                Чтобы спортивная форма, экипировка с нанесением долго служили и
                выполняли свое предназначение нужен правильный уход. Всего несколько
                советов помогут продлить срок службы.
            </p>

            <p>
                В первую очередь ознакомьтесь с правилами стирки указанными на вшивном
                ярлыке с изнаночной стороны вашего изделия.
            </p>

            <p>
                Самым важным советом по уходу за вещами, будет стирать её после каждой
                тренировки, не откладывая. Так как на тренировках мы потеем, а пот -
                это раствор солей и органических веществ, которые могут разрушать
                ткань. Еще очень важно, не бросать мокрые вещи сразу в сумку. Лучше
                если это будет пакет, а затем уже сумка, и тогда не придется стирать
                сумку каждый раз.
            </p>
            <ul>
                <li><strong>Стирайте вещи вывернутыми наизнанку.</strong></li>
                <li><strong>Замки должны быть застегнуты.</strong></li>
                <li><strong>Температура не больше 30-40 градусов.</strong></li>
                <li>
                    <strong>Программу стирки выбираем с минимальным временем.</strong>
                    Так как особых загрязнений нет, этого будет достаточно. Есть
                    программы типа повседневной стирки или быстрой, около полу часа
                    стирки будет более чем достаточно.
                </li>
                <li>
                    <strong>Пониженные обороты отжима.</strong> Если есть возможность
                    снизить обороты в вашей стиральной машинке, будет очень кстати, веди
                    высокие обороты разрушают ткань. А такая одежда и так быстро сохнет.
                </li>
                <li>
                    <strong>Выбирайте мягкое средство для стирки</strong> (cейчас даже
                    есть специальные, с отметкой SPORT).
                </li>
                <li><strong>Не добавляйте смягчающий кондиционер.</strong></li>
                <li><strong>Не добавляйте отбеливатель.</strong></li>
                <li>
                    Если требуется
                    <strong>глажка, лучше это сделать отпаривателем,</strong> или на
                    минимальной температуре утюга,
                    <strong>выворачивая наизнанку.</strong>
                </li>
            </ul>
            <p>
                Эти простые советы помогут продлить срок эксплуатации вашей одежды для
                тренировок. Проставьте галочку в окне «Я ОЗНАКОМЛЕН С ПРАВИЛАМИ УХОДА»
                Только после этого вы сможете перейти к подписанию договора.
            </p>
        </td>
    </tr>
</table>
</body>
</html>
